{
  "tokenizer_class": "ADMistralSmall4Tokenizer",
  "auto_map": {
    "AutoTokenizer": [
      "processing_mistral_small_4.ADMistralSmall4Tokenizer",
      null
    ]
  },
  "source_model_name_or_path": "mistralai/Mistral-Small-4-119B-2603"
}
